Revit 2024 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceDiscardedSplittersWarning Property
 Not all intersecting references (levels, reference planes or lines) could be used to intersect the surface
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DividedSurfaceDiscardedSplittersWarning { get; }
Visual Basic
Public Shared ReadOnly Property DividedSurfaceDiscardedSplittersWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DividedSurfaceDiscardedSplittersWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace